{"pageProps":{"postData":{"id":"life-in-college","contentHtml":"<p>無事単位の計算が間違っていなくて卒業できればあと数ヶ月でいったん学生という身分とはおさらばです。\nそこで今振り返ってみて大学の間にやってよかったこととやればよかったと後悔していることを残しておきます。</p>\n<h2>やってよかったこと</h2>\n<h3>自分の好奇心に忠実に行動できた</h3>\n<p><img src=\"https://i.gyazo.com/684f375d6f6282488dbfa25f7c491392.jpg\" alt=\"Bohol\"></p>\n<p>大学に入って1年くらい経ったタイミングでアプリ開発への好奇心が爆発して熱中できたことは非常によかったです。<br>\nそのほかにも外国にひとり旅に行ったり外国でインターンしたりと興味を持ったらとりあえず挑戦できたことは、今振り返ると人生の土台となるくらい大きな財産をもたらしてくれたと思います。<br>\n自分の知らない世界に飛び込むのはいつだってしんどいけれど、好奇心に従う勇気はこれからも持ち続けたいです。</p>\n<h3>ひとり暮らしをした</h3>\n<p>これも好奇心に従った例になってしまいますが、学生のあいだにひとり暮らしを経験できて本当によかったと思います。<br>\nエンジニアとして多少稼げるようになってから吉祥寺の井の頭公園の近くのぼろアパートを借りました。<br>\n急に貧乏な生活になったし結構ぎりぎりで生きていた気がするけど思い出がたくさんあり本当にやってよかったと思っています。</p>\n<p>シャワーを浴びたり朝ごはんを食べたりデスクで仕事や勉強をしたり。\n実家にいるときと同じようなことをしているはずなのに、そのすべてが微妙に違いました。</p>\n<p>初めて味わうひとりの時間がとても楽しかったです。</p>\n<p>目標としていたインターンの採用が決まった朝とか最終選考でお祈りされてしまった夜とか。\nあれは一種の青春だったなあと既に感慨深く思います。</p>\n<p><img src=\"https://i.gyazo.com/8beb763a26e71b5f369e546536a60ef1.jpg\" alt=\"Kichijoji\"></p>\n<p>朝はよく近所の井の頭公園を散歩したり、夜は錆び付いたぼろ窓の隙間から星空をみて厨二っぽいことを考えたり。</p>\n<p>いまだにその気温や匂いが思い出されるくらい鮮明に頭に残っています。</p>\n<p>これはあのあまりお金もなく将来もまったく見えていないあの時期にひとり暮らしに挑戦したからこそ味わえた時間だったと思います。</p>\n<p><img src=\"https://i.gyazo.com/ca10a3e48a433c8e738d099950d22ef7.jpg\" alt=\"Hikkoshi\"></p>\n<p>ひとり暮らしやってよかったです！吉祥寺というチョイスも最高だった！</p>\n<h2>やればよかったこと後悔していること</h2>\n<h3>大学の専攻にもっと力を入れて取り組めばよかった</h3>\n<p>アプリをつくることにどっぷりハマってしまってからは、将来性もプログラミングのほうがあるしと思って大学の専攻であるフランス語の勉強やフランス地域の研究から少し力を抜いてしまいました。</p>\n<p>最終的にエンジニアとして就職したわけですし、その判断は間違っていなかったのですが、それでももう少し専攻もがんばっておけばよかったと今になって思います。</p>\n<p>私は将来どこかのタイミングで必ず海外で働いてみたいです。これは中学生のころからずっと思っていることで中学の卒業文集にもそう書いていました。<br>\n中学生で初めて海外に行った自分が飛行機から下を見て世界はこんなに広いのにどうして一生をずっと日本で過ごすのかと疑問に思ったみたいです。<br>\nちなみに今もそう思います。</p>\n<p>そうなると今フランス語がもっとペラペラ喋れたら選択肢も増えたなあと思うわけです。</p>\n<p>Steve Jobsの\"The connecting dots\"の話は言い得て妙だと実感しました。</p>\n<p>今後この経験を生かして、目の前のことをその時はあまり意味がないように思えても、とにかく全力で取り組むようにします。</p>\n<h3>大学に友だちをたくさんつくればよかった</h3>\n<p>エンジニアとして働き始めてしまってからは自分はほとんど学外のコミュニティにいて大学での人との関わりはありませんでした。</p>\n<p>大学4年とかになっていざ友だちをつくろうと思ってもそれぞれのコミュニティは固定され成熟してしまっているので飛び込めず...</p>\n<p>さらに追い討ちをかけるように最後の1年なんかはパンデミックのせいで大学にほとんど行かなかったので友だちをつくるチャンスはほとんどありませんでした。</p>\n<p>大学の低学年のうちにもっと大学に友だちをつくっておけばよかったと後悔しています。</p>\n<h2>まとめ</h2>\n<p>もちろんまだまだよかったこと後悔していることはあるのですが、パッと思い浮かぶのはこれくらいです。\n振り返ってばかりでも仕方ないので前を向いてまた一歩ずつ頑張ろうと思います。\n総じて楽しい学生生活でした！関わっていただいた皆さんに感謝しています！\n今後もよろしくお願いします。</p>\n<p>いまじん</p>\n","title":"大学生活でやってよかったこと後悔していること","date":"2021-01-18","draft":false}},"__N_SSG":true}